---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.UtilizationCoefficientOutOfRange
source: html/a9819040-de6b-a782-cc1c-4868a2d932aa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.UtilizationCoefficientOutOfRange Property

The value for Coefficient of Utilization must be between 0 and 1.

## Syntax (C#)
```csharp
public static FailureDefinitionId UtilizationCoefficientOutOfRange { get; }
```